In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
df = pd.read_csv("Churn_Modelling.csv")

In [4]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [36]:
x = df.iloc[:, 3:-1]
y = df.iloc[:, -1]

In [38]:
x.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,France,Female,42,2,0.00,1,1,1,101348.88
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58
2,502,France,Female,42,8,159660.80,3,1,0,113931.57
3,699,France,Female,39,1,0.00,2,0,0,93826.63
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10

In [39]:
y.head()

0    1
1    0
2    1
3    0
4    0
Name: Exited, dtype: int64

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
RowNumber          10000 non-null int64
CustomerId         10000 non-null int64
Surname            10000 non-null object
CreditScore        10000 non-null int64
Geography          10000 non-null object
Gender             10000 non-null object
Age                10000 non-null int64
Tenure             10000 non-null int64
Balance            10000 non-null float64
NumOfProducts      10000 non-null int64
HasCrCard          10000 non-null int64
IsActiveMember     10000 non-null int64
EstimatedSalary    10000 non-null float64
Exited             10000 non-null int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [27]:
from sklearn.preprocessing import LabelBinarizer

In [28]:
lb = LabelBinarizer()

In [55]:
x = pd.concat([pd.DataFrame(lb.fit_transform(np.array(df['Geography']))),x], axis=1)

In [56]:
x = pd.concat([pd.DataFrame(lb.fit_transform(np.array(df['Gender']))),x], axis=1)

In [63]:
x.head(10)

,0,0,1,2,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,0,1,0,0,619,42,2,0.00,1,1,1,101348.88
1,0,0,0,1,608,41,1,83807.86,1,0,1,112542.58
2,0,1,0,0,502,42,8,159660.80,3,1,0,113931.57
3,0,1,0,0,699,39,1,0.00,2,0,0,93826.63
4,0,0,0,1,850,43,2,125510.82,1,1,1,79084.10
5,1,0,0,1,645,44,8,113755.78,2,1,0,149756.71
6,1,1,0,0,822,50,7,0.00,2,1,1,10062.80
7,0,0,1,0,376,29,4,115046.74,4,1,0,119346.88
8,1,1,0,0,501,44,4,142051.07,2,0,1,74940.50
9,1,1,0,0,684,27,2,134603.88,1,1,1,71725.73

In [59]:
x.drop(['Geography', 'Gender'], axis=1, inplace=True)

In [61]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
0                  10000 non-null int64
0                  10000 non-null int64
1                  10000 non-null int64
2                  10000 non-null int64
CreditScore        10000 non-null int64
Age                10000 non-null int64
Tenure             10000 non-null int64
Balance            10000 non-null float64
NumOfProducts      10000 non-null int64
HasCrCard          10000 non-null int64
IsActiveMember     10000 non-null int64
EstimatedSalary    10000 non-null float64
dtypes: float64(2), int64(10)
memory usage: 937.6 KB

In [64]:
x.columns

Index([                0,                 0,                 1,
                       2,     'CreditScore',             'Age',
                'Tenure',         'Balance',   'NumOfProducts',
             'HasCrCard',  'IsActiveMember', 'EstimatedSalary'],
      dtype='object')

In [65]:
x.drop(2, axis=1, inplace=True)

In [66]:
x.head()

,0,0,1,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,0,1,0,619,42,2,0.00,1,1,1,101348.88
1,0,0,0,608,41,1,83807.86,1,0,1,112542.58
2,0,1,0,502,42,8,159660.80,3,1,0,113931.57
3,0,1,0,699,39,1,0.00,2,0,0,93826.63
4,0,0,0,850,43,2,125510.82,1,1,1,79084.10

In [67]:
from sklearn.model_selection import train_test_split

In [68]:
x_train,x_test,y_train,y_test = train_test_split(x,y, test_size=0.2, random_state=0)

In [69]:
from sklearn.preprocessing import StandardScaler

In [70]:
sc = StandardScaler()

In [71]:
x_train = sc.fit_transform(x_train)
x_test = sc.fit_transform(x_test)

In [74]:
import keras

Using TensorFlow backend.

In [75]:
from keras.models import Sequential
from keras.layers import Dense

In [76]:
classifier = Sequential()

WARNING: Logging before flag parsing goes to stderr.
W0703 18:58:36.372775 140124781307648 deprecation_wrapper.py:119] From /home/anonymous/miniconda3/envs/datascience/lib/python3.7/site-packages/keras/backend/tensorflow_backend.py:74: The name tf.get_default_graph is deprecated. Please use tf.compat.v1.get_default_graph instead.

In [78]:
classifier.add(Dense(units=6, kernel_initializer='uniform', activation='relu',input_dim=11))

In [79]:
classifier.add(Dense(units=6, kernel_initializer='uniform', activation='relu'))

In [80]:
classifier.add(Dense(units=1, kernel_initializer='uniform', activation='sigmoid'))

In [81]:
classifier.compile(optimizer='adam',loss='binary_crossentropy', metrics=['accuracy'])

W0703 19:27:11.514684 140124781307648 deprecation_wrapper.py:119] From /home/anonymous/miniconda3/envs/datascience/lib/python3.7/site-packages/keras/optimizers.py:790: The name tf.train.Optimizer is deprecated. Please use tf.compat.v1.train.Optimizer instead.

W0703 19:27:11.637650 140124781307648 deprecation_wrapper.py:119] From /home/anonymous/miniconda3/envs/datascience/lib/python3.7/site-packages/keras/backend/tensorflow_backend.py:3376: The name tf.log is deprecated. Please use tf.math.log instead.

W0703 19:27:11.665104 140124781307648 deprecation.py:323] From /home/anonymous/miniconda3/envs/datascience/lib/python3.7/site-packages/tensorflow/python/ops/nn_impl.py:180: add_dispatch_support.<locals>.wrapper (from tensorflow.python.ops.array_ops) is deprecated and will be removed in a future version.
Instructions for updating:
Use tf.where in 2.0, which has the same broadcast rule as np.where